const questions = [
    {
        number: "1",
        question: "네트워크에 대한 설명으로 가장 잘못된 것은?",
        options: [
            "하나의 네트워크에 다수의 네트워크를 연결함으로써 음성, 오디오, 영상, 데이터 등도 전송할 수 있다.",
            "대역폭은 네트워크를 통해 전송되는 데이터의 최소 전송단위이다.",
            "통신 설비로 두 대 이상의 컴퓨터를 서로 연결한 것을 말한다.",
            "모뎀이나 LAN, 케이블, 무선매체 등 통신 설비를 갖춘 컴퓨터로 서로 연결하는 조직이나 체계, 통신망이다."
        ],
        answer: "대역폭은 네트워크를 통해 전송되는 데이터의 최소 전송단위이다.",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "2",
        question: "다수의 컴퓨터를 네트워크로 연결했을 때 얻을 수 있는 장점으로 거리가 먼 것은?",
        options: [
            "손쉬운 백업",
            "능률적인 통신",
            "주변장치 공유",
            "데이터 독점"
        ],
        answer: "데이터 독점",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "3",
        question: "패킷에 대한 설명으로 잘못된 것은?",
        options: [
            "헤더는 데이터의 형태와 데이터의 송수신지, 일련번호 등으로 구성된다.",
            "제어 요소는 실제 전송데이터를 포함하는 부분이다.",
            "네트워크를 통해 한 컴퓨터에서 다른 컴퓨터로 데이터를 패킷으로 분할해야 한다.",
            "패킷은 헤더, 페이로드, 제어 요소 등을 포함하는 데이터 세그먼트이다."
        ],
        answer: "제어 요소는 실제 전송데이터를 포함하는 부분이다.",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "4",
        question: "현재 사용하고 있는 컴퓨터의 IP 주소를 확인하고 싶을 때 사용하는 네트워크 명령어로 올바른 것은?",
        options: [
            "ipconfig",
            "netuser",
            "hostname",
            "ping"
        ],
        answer: "ipconfig",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "5",
        question: "웹 사이트의 IP 주소를 확인할 수 있는 네트워크 명령어로 올바른 것은?(2개)",
        options: [
            "mac 도메인명",
            "arp 도메인명",
            "tracert 도메인명",
            "ping 도메인명"
        ],
        answer: ["tracert 도메인명", "ping 도메인명"],
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "6",
        question: "네트워크에서 이용 가능한 최대 전송속도로 정보를 전송할 수 있는 단위 시간당 전송량으로 올바른 것은?",
        options: [
            "주파수",
            "바이트",
            "대역폭",
            "클록"
        ],
        answer: "대역폭",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "7",
        question: "LAN에 대한 설명으로 가장 거리가 먼 것은?",
        options: [
            "ISP가 제공하는 서비스를 사용하여 구축된 네트워크이다.",
            "건물 안이나 특정 지역을 범위로 하는 네트워크이다.",
            "LAN은 연결하는 거리가 짧은 만큼 WAN보다 신호가 약해지거나 오류가 발생할 확률이 높다.",
            "유선 케이블, 적외선 링크, 무선 송수신기 등을 이용하여 통신한다."
        ],
        answer: "LAN은 연결하는 거리가 짧은 만큼 WAN보다 신호가 약해지거나 오류가 발생할 확률이 높다.",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "8",
        question: "스위칭 허브에 대한 설명으로 잘못된 것은?",
        options: [
            "노드들을 각각 점대점으로 접속하기 때문에 네트워크의 효율이 훨씬 낮다.",
            "여러 대의 컴퓨터를 손쉽게 연결하는 장치이다.",
            "전체 대역폭을 각 컴퓨터 노드 수만큼 나눠서 사용하는 문제점을 해결한 접속장치이다.",
            "단순히 전송하는 기능을 넘어 수신지 주소로 스위칭하는 기능이 있다."
        ],
        answer: "노드들을 각각 점대점으로 접속하기 때문에 네트워크의 효율이 훨씬 낮다.",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "9",
        question: "라우터에 대한 설명으로 잘못된 것은?",
        options: [
            "라우팅은 라우터에 있는 라우팅 테이블이 결정한다.",
            "오류 패킷의 폐기 기능과 혼잡을 제어하는 기능이 없다.",
            "서로 다른 네트워크 간에 통신하는 데 사용하는 장치이다.",
            "효율적인 경로를 선택하는 라우팅 테이블이 결정한다."
        ],
        answer: "오류 패킷의 폐기 기능과 혼잡을 제어하는 기능이 없다.",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "10",
        question: "트리형 접속 형태에 대한 설명으로 잘못된 것은?",
        options: [
            "여러 컴퓨터를 분리하거나 우선순위를 부여할 수 있다.",
            "각 장비 간의 데이터 전송 거리를 늘릴 수 있다.",
            "제어가 간단하여 관리나 네트워크 확장이 쉽다.",
            "중앙에 트래픽이 집중되는 병목현상이 발생하지 않는다."
        ],
        answer: "중앙에 트래픽이 집중되는 병목현상이 발생하지 않는다.",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "11",
        question: "다음 중 유선 전송 매체의 종류로 잘못된 것은?",
        options: [
            "광섬유케이블",
            "라디오파", 
            "꼬임선",
            "동축케이블"
        ],
        answer: "라디오파",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "12",
        question: "UTP 카테고리 5에 해당되는 전송속도로 올바른 것은?",
        options: [
            "10Mbps",
            "4Mbps",
            "100Mbps",
            "16Mbps"
        ],
        answer: "100Mbps",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "13",
        question: "무선 주파수 대역인 초단파 파장을 나타내는 약어로 올바른 것은?",
        options: [
            "SHF",
            "LF",
            "VLF",
            "VHF"
        ],
        answer: "VHF",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "14",
        question: "(IPv4) LAN에서 통신하는 방식으로 가장 거리가 먼 것은?",
        options: [
            "유니캐스트",
            "브로드캐스트",
            "애니캐스트",
            "멀티캐스트"
        ],
        answer: "애니캐스트",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "15",
        question: "반이중 통신에 대한 설명으로 잘못된 것은?",
        options: [
            "송신 측과 수신 측이 미리 고정되어 있다.",
            "휴대용 무전기와 모뎀을 이용한 데이터통신이 해당한다.",
            "통신채널에 접속한 두 대의 단말기 중 어느 한쪽이 데이터를 송신하면 상대방은 수신만 할 수 있다.",
            "하나의 통신채널을 이용하여 교대로 데이터를 송수신할 수 있다."
        ],
        answer: "송신 측과 수신 측이 미리 고정되어 있다.",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "16",
        question: "비트 지향 동기화 기법에 대한 설명으로 잘못된 것은?",
        options: [
            "데이터 블록의 처음과 끝에 8비트의 플래그 비트를 표시하여 동기를 맞추는 방식이다.",
            "비트 지향 동기화 기법은 데이터의 시작과 끝을 알리는 시작 플래그로 시작해서 종료 플래그로 끝난다.",
            "전송하는 모든 데이터 단위를 일련의 비트로 처리함으로써 동기화에 필요한 데이터까지 비트로 표현한다.",
            "사용하는 동기 문자에는 SYN, 문장의 시작을 알리는 STX, 문장의 끝을 알리는 ETX등 이 있다."
        ],
        answer: "사용하는 동기 문자에는 SYN, 문장의 시작을 알리는 STX, 문장의 끝을 알리는 ETX등 이 있다.",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "17",
        question: "홀수 패리티 검사 방식을 적용한 예로 올바른 것은?",
        options: [
            "00011000",
            "10010001",
            "11001100",
            "10101010"
        ],
        answer: "10010001",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "18",
        question: "10Base-2의 설명으로 잘못된 것은?",
        options: [
            "전송매체로 얇은 동축케이블을 사용하는 이터넷 구성 방식이다.",
            "설치가 용이하고 설치비용이 저렴하다.",
            "브로드밴드 방식을 사용한다.",
            "10Base-5와 성능이 같고 한세그먼트의 최장거리는 200m이다."
        ],
        answer: "브로드밴드 방식을 사용한다.",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "19",
        question: "CSMA/CD방식에 대한 설명으로 잘못된 것은?",
        options: [
            "전송 지연으로 인한거리에 제약이 없이 리피터가 필요 없다.",
            "OSI 참조모델의 데이터링크 계층에 대항하는 LLC계층으로부터 데이터 송신요구를 받은MAC계층은 매체가 비어있는지 반송파로 확인하여 비어있으면 데이터를 송신한다.",
            "보통 버스형과 트리형 접속형태의 LAN에 많이 사용한다.",
            "여러 컴퓨터가 동시에 데이터를 전송할 때는 전송 매체의 충돌 발생 여부를 조사하여 충 돌이 감지되면 데이터 전송을 중지하고 모든 컴퓨터에 잼신호를 송신하여 충돌 사실을 알린다."
        ],
        answer: "전송 지연으로 인한거리에 제약이 없이 리피터가 필요 없다.",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "20",
        question: "패킷 교환방식에 대한 설명으로 잘못된 것은?",
        options: [
            "전송이 없는 상태에서도 회신을 점유하는 회선교환방식에 비해 전송효율이 높다.",
            "데이터를 전송할 때 과부하가 생기면 전송 지연이 발생한다.",
            "우선순위가 높은 패킷을 먼저 전송할 수 없다.",
            "처리 속도가 다른 통신 기기 간에도 정보를 전송할 수 있다."
        ],
        answer: "우선순위가 높은 패킷을 먼저 전송할 수 없다.",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "21",
        question: "OSI 참조모델의 계층으로 잘못된 것은?",
        options: [
            "전송계층",
            "물리계층",
            "분석계층",
            "데이터링크계층"
        ],
        answer: "분석계층",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "22",
        question: "OSI 참조모델의 데이터 전송에 대한 설명으로 잘못된 것은?",
        options: [
            "송신 측이 헤더를 생성하여 추가하면 수신 측에서 해당 계층이 이 헤더를 사용한다.",
            "상위 계층이나 하위계층 사이에 주고받은 것을 프로토콜 데이터 단위(PDU)라고 한다.",
            "각 계층은 헤더와 데이터 단위로 정의되는데, 헤더에는 각 계층의 기능과 관련된 정보가 포함된다.",
            "데이터 단위는 상위 계층에서 전송을 원하는 데이터인 SDU에 제어 정보인 PCI를 추가한 것으로, 제어 정보에는 흐름제어 정보, 오류 제어 정보, 주소 정보 등이 포함된다."
        ],
        answer: "상위 계층이나 하위계층 사이에 주고받은 것을 프로토콜 데이터 단위(PDU)라고 한다.",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "23",
        question: "물리계층에 대한 설명으로 잘못된 것은?",
        options: [
            "네트워크의 두 노드를 물리적으로 연결해주는 신호 방식등을 다룬다.",
            "데이터링크계층에서 한 단위의 데이터를 받고 통신 링크를 따라 전송할 수 있는 형태로 변환한다.",
            "물리계층은 물리적매체를 통해 비트흐름을 전송하는데 필요한 기능을 조정한다.",
            "송신측의 물리계층은 데이터링크 계층에서 전기신호를 받아 0과1로 구성된 비트열의 데이터로 변환한 후 전송 매체를 통해 수신 측에 보낸다."
        ],
        answer: "송신측의 물리계층은 데이터링크 계층에서 전기신호를 받아 0과1로 구성된 비트열의 데이터로 변환한 후 전송 매체를 통해 수신 측에 보낸다.",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "24",
        question: "데이터링크계층에 대한 설명으로 잘못된 것은?",
        options: [
            "응용계층에서 데이터 단위를 받아 주소와 제어 정보 같은 의미있는 비트를 시작 부분(이더넷 헤더)과 끝부분(트레일러)에 추가한다.",
            "네트워크를 통해 데이터를 전송할 때 전송로 역할을 한다.",
            "물리적 링크를 이용하여 신뢰성 있는 데이터를 전송하는 계층이다.",
            "물리계층에서 발생할 수 있는 오류를 검출하고 복구하는 오류 제어기능, 동기화, 흐름제어 등을 담당한다."
        ],
        answer: "응용계층에서 데이터 단위를 받아 주소와 제어 정보 같은 의미있는 비트를 시작 부분(이더넷 헤더)과 끝부분(트레일러)에 추가한다.",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "25",
        question: "스위치에 대한 설명으로 잘못된 것은?",
        options: [
            "스위치는 데이터링크계층에서 동작하고 스위칭허브 또는 레이어2 스위치라고 부른다.",
            "회선 하나를 송신과 수신이 번갈아가면서 사용하는 반이중 통신 방식이다.",
            "스위치는 충돌 도메인의 범위가 좁다.",
            "허브와 달리 데이터 충돌이 발생하지 않는다."
        ],
        answer: "회선 하나를 송신과 수신이 번갈아가면서 사용하는 반이중 통신 방식이다.",
        chapter: "네트워크",
        type: "multiple-choice"
    },
    {
        number: "주관식 1",
        question: "네트워크를 통해 데이터를 전송할 때 데이터가 전송되는 기본단위는?",
        answer: "패킷",
        chapter: "네트워크",
        type: "essay"
    },
    {
        number: "주관식 2",
        question: "동기식전송과 비동기식전송의 차이점을 설명하시오.",
        answer: "동기식 전송은 데이터를 블록으로 묶어 한 번에 전송하는 방식이고, 비동기식 전송은 한 문자씩 보내는 방식이다.",
        chapter: "네트워크",
        type: "essay"
    },
    {
        number: "주관식 3",
        question: "회선교환, 패킷교환, 메시지교환에 대해 특징을 중심으로 비교 설명하시오.",
        answer: "회선교환은 전용선을 사용하는 것처럼 통신하며, 패킷교환은 데이터를 패킷 단위로 나누어 전송하고, 메시지교환은 메시지 단위로 저장 후 전송하는 방식이다.",
        chapter: "네트워크",
        type: "essay"
    },
    {
        number: "주관식 4",
        question: "OSI7 계층이 무엇이고 왜 필요한지 설명하시오.",
        answer: "OSI 7 계층은 네트워크 통신을 7개의 계층으로 나눈 모델로, 통신 과정을 단계별로 파악하고 문제 해결을 용이하게 하기 위해 필요하다.",
        chapter: "네트워크",
        type: "essay"
    },
    {
        number: "주관식 5",
        question: "1바이트통신이다. 문자A를보내고자한다. 맨앞1비트를 홀수 패리티비트로 사용하고 생성다항식 G(x)=x4+x3+x2+1을 사용할 때 송신지에서 보내는 데이터 비트열은? (단, A는 10진수로 65)",
        answer: "110000011101",
        chapter: "네트워크",
        type: "essay"
    }
    
];
export default questions;